{
  "events": [
    {
      "id": 8,
      "title": "Hackathon Winners Felicitation",
      "image": [
        "/Images/events/feli_1.JPG",
        "/Images/events/feli_5.JPG",
        "/Images/events/feli_6.JPG",
        "/Images/events/feli_7.JPG",
        "/Images/events/feli_2.JPG",
        "/Images/events/feli_3.JPG",
        "/Images/events/feli_4.JPG"
      ],
      "description": "The IETE Amrita Student Chapter (2024-25) organized two exciting hackathons, Torch It Up and DevX, to showcase the creativity and technical brilliance of students. On 8th April 2025, a prize distribution ceremony was conducted to honor the winners. Cash prizes of ₹2,500, ₹1,500, and ₹1,000 were awarded to the top performing teams of Torch It Up, and ₹1,600 each to the winning teams of DevX. Certificates and prizes were distributed by Dr. Bagavathi Sivakumar P., Chairperson, School of Computing, Coimbatore and Dr. Anantha Narayanan V., Honorary Secretary of IETE Coimbatore, recognizing the remarkable achievements of the participants.",
      "Status": "Past Event",
      "Location": "Anugraha Hall, AB3",
      "Registration": "",
      "Year": "2025",
      "Month": "04",
      "Day": "08",
      "startsAt": "4:30 PM - 5 PM"
    },
    {
      "id": 7,
      "title": "DevX: CODE. CREATE. CONQUER",
      "image": [
        "/Images/events/devx_1.png",
        "/Images/events/devx_2.JPG",
        "/Images/events/devx_3.JPG",
        "/Images/events/devx_4.JPG",
        "/Images/events/devx_5.JPG",
        "/Images/events/devx_6.JPG",
        "/Images/events/devx_7.JPG",
        "/Images/events/devx_8.JPG",
        "/Images/events/devx_9.JPG",
        "/Images/events/devx_10.JPG"
      ],
      "description": "28 teams, 3 hours, 3 problem statements – one epic challenge! DevX was a high-energy web development competition where participants raced against time to solve exciting challenges. With a ₹5K prize pool on the line, teams tackled coding, debugging, and rapid deployments, all while enjoying a fun-filled picture quiz and Bingo showdown. The event was a perfect blend of technical skill, creativity, and collaboration, making it an unforgettable experience. A huge thank you to all participants for making DevX a phenomenal success— events like these remind us that tech is more than just code; it’s about community and shared experiences! ✨",
      "Status": "Past Event",
      "Location": "Seminar Hall (Near Anugraha Hall), AB3",
      "Registration": "",
      "Year": "2025",
      "Month": "03",
      "Day": "18",
      "startsAt": "2 PM - 6 PM"
    },
    {
      "id": 6,
      "title": "Torch It Up 🔥: AI Journey with PyTorch",
      "image": [
        "/Images/events/pytorch_1.png",
        "/Images/events/pytorch_2.JPG",
        "/Images/events/pytorch_3.JPG",
        "/Images/events/pytorch_4.JPG",
        "/Images/events/pytorch_6.JPG",
        "/Images/events/pytorch_5.JPG",
        "/Images/events/pytorch_7.JPG",
        "/Images/events/pytorch_8.JPG",
        "/Images/events/pytorch_9.JPG"
      ],
      "description": "The IETE Amrita Club’s electrifying AI workshop Torch It Up: An AI Journey with PyTorch was a massive success! 🔥💻 With 250+ students from different courses across UG to PG, we packed not just one but two halls, creating an atmosphere buzzing with energy and enthusiasm. From engaging talks and live coding to interactive AI quizzes and an adrenaline-pumping ML Hackathon with a ₹5K prize pool, the event was filled with learning and excitement. The hackathon wrapped up successfully, and we’re thrilled to have announced the winners! 🎉",
      "Status": "Past Event",
      "Location": "Anugraha Hall and Seminar Hall (Near Anugraha Hall), AB3",
      "Registration": "",
      "Year": "2025",
      "Month": "03",
      "Day": "10",
      "startsAt": "9 AM - 12:30 PM"
    },
    {
      "id": 5,
      "title": "Club Induction",
      "image": [
        "/Images/events/induction_poster.png",
        "/Images/events/induction_1.JPG",
        "/Images/events/induction_12.png",
        "/Images/events/induction_2.JPG",
        "/Images/events/induction_3.png",
        "/Images/events/induction_4.png"
      ],
      "description": "The IETE Club Induction Program for the term 2024-25 on Dec 26th, 2024, brought together innovation, inspiration, and interaction. From an insightful keynote by Mr. Velmurugan E to engaging activities and team introductions, the event set the stage for a promising year ahead! 🚀 This marks the beginning of a great journey for IETE Amrita.",
      "Status": "Past Event",
      "Location": "Sandeepani Hall, AB2, Amrita Vishwa Vidyapeetham, Coimbatore",
      "Registration": "https://google.com",
      "Year": "2024",
      "Month": "12",
      "Day": "26",
      "startsAt": "4:30 PM"
    },
    {
      "id": 4,
      "title": "Intel AI Hackathon",
      "image": [
        "/Images/events/IntelAI_1.jpg",
        "/Images/events/intelhack.png",
        "/Images/events/IntelAI_2.jpg",
        "/Images/events/IntelAI_3.jpg",
        "/Images/events/IntelAI_4.jpg"
      ],
      "description": "The intersection of intellect, innovation, and artificial intelligence converged at the prestigious Amrita Vishwa Vidyapeetham Coimbatore Campus for the highly anticipated Intel AI Hackathon conducted during Anokha National Level Techfest 2024. With a total prize poolworth Rs 1,25,000, the event promised not only substantial rewards but also a platform for aspiring technologists to showcase their talents and push the boundaries of AI applications.",
      "Status": "Past Event",
      "Location": "Online",
      "Registration": "Closed",
      "Year": "2024",
      "Month": "2",
      "Day": "15",
      "startsAt": "N/A"
    },
    {
      "id": 3,
      "title": "Women in AI with oneAPI",
      "image": [
        "/Images/events/oneapi_21.jpg",
        "/Images/events/oneapi_221.jpg",
        "/Images/events/oneapi_231.jpg",
        "/Images/events/oneapi_271.jpg"
      ],
      "description": "The IETE Club, in collaboration with the IEEE Student Branch, hosted Women in AI with oneAPI on December 11, 2023, featuring Dr. Shriram K Vasudevan from Intel. The event celebrated women's contributions to AI, highlighting Intel's oneAPI technology through insightful talks, a panel discussion, and project showcases. With inspiring sessions and networking opportunities, it fostered a strong community, empowering women in AI to innovate and lead. 🚀",
      "Status": "Past Event",
      "Location": "Murilarikrishna hall, CIR block , Amrita Vishwa Vidyapeetam, Coimbatore",
      "Registration": "Closed",
      "Year": "2023",
      "Month": "12",
      "Day": "11",
      "startsAt": "9:00 AM"
    },
    {
      "id": 2,
      "title": "Docker Workshop",
      "image": [
        "/Images/events/docker_1.jpg",
        "/Images/events/docker_2.png",
        "/Images/events/docker_3.png",
        "/Images/events/docker_5.png"
      ],
      "description": "The IETE Club's Docker Workshop at Amrita Vishwa Vidyapeetham provided participants with hands-on experience in Docker, Linux kernels, and web development. The event featured interactive sessions, a Dockerization competition, and practical demonstrations on containerization. With enthusiastic participation and engaging activities, the workshop successfully enhanced students' technical skills and teamwork. 🚀",
      "Status": "Past Event",
      "Location": "Seminar Hall, AB3, Amrita Vishwa Vidyapeetham, Coimbatore",
      "Registration": "Closed",
      "Year": "2023",
      "Month": "12",
      "Day": "01",
      "startsAt": "9:00 AM"
    },
    {
      "id": 1,
      "title": "Raspberry Pi Workshop",
      "image": [
        "/Images/events/raspberrypi_1.jpg",
        "/Images/events/raspberrypi_2.png",
        "/Images/events/raspberrypi_3.png",
        "/Images/events/raspberrypi_41.png"
      ],
      "description": "The IETE Club at Amrita Vishwa Vidyapeetham hosted an engaging Raspberry Pi and Computer Vision workshop on November 21, 2023, blending theory with hands-on experience. Students explored Raspberry Pi setup, image preprocessing, and Edge Impulse applications under expert guidance. The event successfully bridged the gap between theoretical knowledge and real-world implementation, leaving participants with valuable skills and insights. 🚀",
      "Status": "Past Event",
      "Location": "E-405, AB2, Amrita Vishwa Vidyapeetham, Coimbatore",
      "Registration": "Closed",
      "Year": "2023",
      "Month": "11",
      "Day": "21",
      "startsAt": "2:15 PM"
    }
  ]
}
